Lotlab/nrf52-keyboard/application/main/src/ble/ble_services.c
/*
Copyright (C) 2018,2019 Jim Jiang <jim@lotlab.org>

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <https://www.gnu.org/licenses/>.
*/

#include "ble_services.h"

#include "app_error.h"
#include "app_scheduler.h"
#include "app_timer.h"
#include "ble.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "ble_conn_state.h"
#include "ble_dfu.h"
#include "ble_dis.h"
#include "ble_srv_common.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_bootloader_info.h"
#include "nrf_power.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "peer_manager_handler.h"

#include "ble_config.h"
#include "data_storage.h"
#include "util.h"
#include <string.h>

#define PNP_ID_VENDOR_ID_SOURCE 0x02 /**< Vendor ID Source. */

#define APP_BLE_OBSERVER_PRIO 3 /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG 1 /**< A tag identifying the SoftDevice BLE configuration. */

#define FIRST_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(5000) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(30000) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT 3 /**< Number of attempts before giving up the connection parameter negotiation. */

#define APP_ADV_FAST_INTERVAL 0x0028 /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 25 ms.). */
#define APP_ADV_SLOW_INTERVAL 0x0C80 /**< Slow advertising interval (in units of 0.625 ms. This value corrsponds to 2 seconds). */

#define APP_ADV_FAST_DURATION 3000 /**< The advertising duration of fast advertising in units of 10 milliseconds. */
#define APP_ADV_SLOW_DURATION 18000 /**< The advertising duration of slow advertising in units of 10 milliseconds. */

/*lint -emacro(524, MIN_CONN_INTERVAL) // Loss of precision */
#define MIN_CONN_INTERVAL MSEC_TO_UNITS(7.5, UNIT_1_25_MS) /**< Minimum connection interval (7.5 ms) */
#define MAX_CONN_INTERVAL MSEC_TO_UNITS(30, UNIT_1_25_MS) /**< Maximum connection interval (30 ms). */
#define SLAVE_LATENCY 6 /**< Slave latency. */
#define CONN_SUP_TIMEOUT MSEC_TO_UNITS(430, UNIT_10_MS) /**< Connection supervisory timeout (430 ms). */

uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
static pm_peer_id_t m_peer_id; /**< Device reference handle to the current bonded central. */

#ifdef MULTI_DEVICE_SWITCH

#define MAX_HOST_COUNT 3
#define SWITCH_ID_MAGIC 0x55
CONFIG_SECTION(switch_device_data, (MAX_HOST_COUNT + 1) * sizeof(pm_peer_id_t));

struct switch_device {
    uint8_t id;
    uint8_t magic;
    uint16_t peers_id[MAX_HOST_COUNT];
};

#define switch_storage ((struct switch_device*)switch_device_data.data)
#define switch_device_id_update() storage_write(1 << STORAGE_CONFIG)
#endif

NRF_BLE_GATT_DEF(m_gatt); /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr); /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising); /**< Advertising module instance. */

static ble_uuid_t m_adv_uuids[] = { { BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE } };

static void advertising_config_get(ble_adv_modes_config_t* p_config);

#ifdef MULTI_DEVICE_SWITCH
static uint8_t peer_id_filter(pm_peer_id_t* peer_ids, uint8_t peer_id_count)
{
    uint8_t real_count = 0;

    // filter: remove any peer which is not current channel.
    for (uint8_t i = 0; i < peer_id_count; i++) {
        // check if this peer is on currect channel
        if (peer_ids[i] != switch_storage->peers_id[switch_storage->id]) {
            peer_ids[i] = PM_PEER_ID_INVALID;
        } else {
            peer_ids[real_count++] = peer_ids[i];
            break; // Only 1 peer id per channel.
        }
    }
    return real_count;
}

static void switch_device_reset() 
{
    // 清空所有绑定后，自动回到首个设备
    switch_storage->id = 0;
    switch_storage->magic = SWITCH_ID_MAGIC;
    for (int8_t i = 0; i < MAX_HOST_COUNT; i++)
        switch_storage->peers_id[i] = PM_PEER_ID_INVALID;
    
    switch_device_id_update();
}

#else
#define peer_id_filter(ids, count) (count)
#endif

/**
 * @brief Function for setting filtered whitelist.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void whitelist_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint32_t peer_id_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    peer_id_count = peer_id_filter(peer_ids, peer_id_count);

    err_code = pm_whitelist_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for setting filtered device identities.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void identities_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
    uint32_t peer_id_count = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    peer_id_count = peer_id_filter(peer_ids, peer_id_count);

    err_code = pm_device_identities_list_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief 断开某个设备的连接
 * 
 * @param conn_handle 
 * @param p_context 
 */
static void device_disconnect(uint16_t conn_handle, void* p_context)
{
    UNUSED_PARAMETER(p_context);
    sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

static app_sched_event_handler_t on_disconnect_handler = NULL;

/**
 * @brief 断开所有已经连接的设备，并设置不再重新广播
 * 
 */
static void ble_disconnect(app_sched_event_handler_t on_disconnect)
{
    // Prevent device from advertising on disconnect.
    ble_adv_modes_config_t config;
    advertising_config_get(&config);
    config.ble_adv_on_disconnect_disabled = true;
    ble_advertising_modes_config_set(&m_advertising, &config);

    // Disconnect all other bonded devices that currently are connected.
    ble_conn_state_for_each_connected(device_disconnect, NULL);

    // In case of advertising
    if (m_advertising.adv_mode_current != BLE_ADV_MODE_IDLE) {
        (void)sd_ble_gap_adv_stop(m_advertising.adv_handle);
    }

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
        on_disconnect_handler = on_disconnect;
    } else if (on_disconnect != NULL) {
        app_sched_event_put(NULL, 0, on_disconnect);
    }
}

#ifdef BUTTONLESS_DFU
static void buttonless_dfu_sdh_state_observer(nrf_sdh_state_evt_t state, void* p_context)
{
    if (state == NRF_SDH_EVT_STATE_DISABLED) {
        // Softdevice was disabled before going into reset. Inform bootloader to skip CRC on next boot.
        nrf_power_gpregret2_set(BOOTLOADER_DFU_SKIP_CRC);

        //Go to system off.
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
    }
}

