Lotlab/nrf52-keyboard/application/main/src/ble/ble_services.c
/* nrf_sdh state observer. */
NRF_SDH_STATE_OBSERVER(m_buttonless_dfu_state_obs, 0) = {
    .handler = buttonless_dfu_sdh_state_observer,
};
#endif

#ifdef MACADDR_SEPRATOR
/**
 * @brief MAC地址转换为设备名后缀.
 *
 * 读取MAC地址，并将其转换后放置到设备名最后
 */
static void get_device_name(char* device_name, int offset)
{
    const char lookup_table[] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };

    strcpy(device_name, DEVICE_NAME);
    device_name[offset++] = MACADDR_SEPRATOR;

    ble_gap_addr_t ble_addr;
    sd_ble_gap_addr_get(&ble_addr);

    for (uint8_t i = 0; i < 3; i++) {
        uint8_t addr = ble_addr.addr[3 + i];
        device_name[offset++] = lookup_table[addr / 16];
        device_name[offset++] = lookup_table[addr % 16];
    }
    device_name[offset] = 0x00;
}
#endif

/**
 * @brief 设置蓝牙设备的名称
 * 
 */
static void set_device_name(void)
{
    ret_code_t err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

#ifdef MACADDR_SEPRATOR
    int orig_len = strlen(DEVICE_NAME);
    int name_len = orig_len + 8;
    char device_name[name_len];
    get_device_name(device_name, orig_len);

    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t*)device_name, strlen(device_name));
#else
    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t*)DEVICE_NAME, strlen(DEVICE_NAME));
#endif
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief 清空所有绑定数据.
 */
void delete_bonds(void)
{
    ble_disconnect(NULL);

    ret_code_t err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
#ifdef MULTI_DEVICE_SWITCH
    switch_device_reset();
#endif
}

#ifdef MULTI_DEVICE_SWITCH
/**
 * @brief 禁用后重新启用广播
 * 
 */
static void reenable_advertising()
{
    // set whitelist
    whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

    // Enable reconnect
    ble_adv_modes_config_t config;
    advertising_config_get(&config);
    config.ble_adv_on_disconnect_disabled = false;
    ble_advertising_modes_config_set(&m_advertising, &config);

    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(ret);
    }
}

/**
 * @brief 根据当前的设备ID设置蓝牙地址
 * 
 * @param id 
 */
static void set_gap_addr_by_id(uint8_t id)
{
    ble_gap_addr_t gap_addr;
    ret_code_t ret = sd_ble_gap_addr_get(&gap_addr);
    APP_ERROR_CHECK(ret);

    gap_addr.addr[0] = (gap_addr.addr[0] & 0x1F) | ((id & 0x07) << 5);

    ret = sd_ble_gap_addr_set(&gap_addr);
    APP_ERROR_CHECK(ret);
}

static void switch_device_select_after(void* p_data, uint16_t len)
{
    set_gap_addr_by_id(switch_storage->id);

    reenable_advertising();
    // 触发蓝牙设备通道切换事件
    trig_event_param(USER_EVT_BLE_DEVICE_SWITCH, switch_storage->id);
}

/**
 * @brief 切换连接设备.
 *
 * @param[in] id  要切换的设备的ID号
 */
void switch_device_select(uint8_t id)
{
    // 如果重复切换，则直接退出，不做任何操作
    if (id == switch_storage->id)
        return;

    switch_storage->id = id;
    switch_device_id_update();

    ble_disconnect(switch_device_select_after);
}

static void switch_device_rebond_after(void* p_data, uint16_t size)
{
    pm_peer_delete(switch_storage->peers_id[switch_storage->id]);
    switch_storage->peers_id[switch_storage->id] = PM_PEER_ID_INVALID;
    switch_device_id_update();
    reenable_advertising();
}

/**
 * @brief 重新绑定当前设备.
 *
 */
void switch_device_rebond()
{
    ble_disconnect(switch_device_rebond_after);
}
/**
 * @brief 切换连接设备初始化.
 *
 * 读取存储的当前连接设备ID，并激活为当前连接设备
 */
static void switch_device_init()
{
    if (switch_storage->magic != SWITCH_ID_MAGIC) {
        switch_device_reset();
    }
    set_gap_addr_by_id(switch_storage->id);
}

/**
 * @brief 更新切换设备数据.
 *
 * 获取当前gap addr并更新PM数据
 */
static void switch_device_update(pm_peer_id_t peer_id)
{
    switch_storage->peers_id[switch_storage->id] = peer_id;
    switch_device_id_update();
}
#endif

/**
 * @brief 开启蓝牙广播.
 * 
 * @param[in] erase_bonds  是否清空所有绑定数据
 */
void advertising_start(bool erase_bonds)
{
    if (erase_bonds) {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    } else {
#ifdef MULTI_DEVICE_SWITCH
        switch_device_init();
#endif
        whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

        ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(ret);
    }
}

/**
 * @brief 重新开启蓝牙广播.
 * 
 * @param[in] mode  广播模式
 * @param[in] whitelist  是否启用白名单
 */
void advertising_restart(ble_adv_mode_t mode, bool whitelist)
{
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        sd_ble_gap_adv_stop(m_advertising.adv_handle);
        ble_advertising_start(&m_advertising, mode);
    } else {
        sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    }

    if (!whitelist) {
        ble_advertising_restart_without_whitelist(&m_advertising);
    }
}

/**
 * @brief 蓝牙进入慢速广播模式
 * 
 */
void advertising_slow()
{
    ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_SLOW);
    APP_ERROR_CHECK(ret);
}

static void advertising_config_get(ble_adv_modes_config_t* p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));
#ifdef MULTI_DEVICE_SWITCH
    p_config->ble_adv_whitelist_enabled = true;
#else
    p_config->ble_adv_whitelist_enabled = false;
#endif
    p_config->ble_adv_directed_high_duty_enabled = true;
    p_config->ble_adv_directed_enabled = false;
    p_config->ble_adv_directed_interval = 0;
    p_config->ble_adv_directed_timeout = 0;
    p_config->ble_adv_fast_enabled = true;
    p_config->ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
    p_config->ble_adv_fast_timeout = APP_ADV_FAST_DURATION;
    p_config->ble_adv_slow_enabled = true;
    p_config->ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
    p_config->ble_adv_slow_timeout = APP_ADV_SLOW_DURATION;
    p_config->ble_adv_on_disconnect_disabled = false;
}

#ifdef BUTTONLESS_DFU
/**
 * @brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
    switch (event) {
    case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE: {
        // This is required to receive a service changed indication
        // on bootup after a successful (or aborted) Device Firmware Update.
        ble_disconnect(NULL);
        break;
    }

    case BLE_DFU_EVT_BOOTLOADER_ENTER:
        // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
        //           by delaying reset by reporting false in app_shutdown_handler
        break;

    case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
        // YOUR_JOB: Take corrective measures to resolve the issue
        //           like calling APP_ERROR_CHECK to reset the device.
        APP_ERROR_CHECK(false);
        break;

